PhanLeSon03/Mic_Array/Projects/STM32746G/Applications/Audio/Mic_Array/Src/main.c

/*****************************************************************************
  *    Author: Phan Le Son                                                                                           
  *    Company: Autonomous.ai                                            
  *    email: plson03@gmail.com
  *****************************************************************************/



/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "DSP.h"
//#include "waveplayer.h"
#include "waverecorder.h"
#include "stm32f7xx_hal_usart.h"
#include "pdm_filter.h"
#include "arm_math.h"
#include <stdio.h>


/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/


/* EXTERN VARIABLES ----------------------------------------------------------*/
//extern __IO AUDIO_IN_BufferTypeDef Buffer1, Buffer2, BufferCtlRecIn;
//AUDIO_IN_BufferTypeDef Buffer3;




extern Mic_Array_Data Buffer1,Buffer2,Buffer3;

extern __IO uint8_t XferCplt;
extern __IO AUDIO_IN_BufferTypeDef BufferCtlRecIn;
extern DMA_HandleTypeDef     DmaHandle;

extern SAI_HandleTypeDef         haudio_out_sai;
extern uint8_t WaveRecord_flgIni;
extern uint32_t EnergySound,EnergyError;
extern I2C_HandleTypeDef hi2c2;
extern __IO uint16_t cntStrt;
extern __IO int16_t SPI1_stNipple,I2S1_stNipple, I2S2_stNipple,SPI4_stNipple;
extern __IO   uint8_t I2S1_stPosShft,I2S2_stPosShft,SPI4_stPosShft;
extern USBD_AUDIO_ItfTypeDef  USBD_AUDIO_fops;
/* GLOBAL VARIABLE -----------------------------------------------------------*/
USBH_HandleTypeDef hUSBHost;
USBD_HandleTypeDef hUSBDDevice;
AUDIO_ApplicationTypeDef appli_state = APPLICATION_IDLE;//APPLICATION_IDLE

UART_HandleTypeDef huart3;
SPI_HandleTypeDef hspi4;
GPIO_InitTypeDef GPIO_INS;
Mic_Array_Coef_f FacMic;
	  
uint16_t bufferSum[6*AUDIO_OUT_BUFFER_SIZE+10];
float CrssCorVal78,CrssCorVal14,CrssCorVal25,CrssCorVal63;

__IO uint16_t  WaveRec_idxSens4,WaveRec_idxSens3,I2S2_idxTmp;
__IO uint16_t  WaveRec_idxSens1,WaveRec_idxSens2;
__IO uint16_t  WaveRec_idxSens5,WaveRec_idxSens6;
__IO uint16_t  idxSPI5DataBuf3;
__IO uint16_t  cntRisingEXTI;
__IO uint8_t   btnSW1,btnSW2;
__IO uint8_t   flgDlyUpd; 
__IO uint8_t   cntBtnPress;
__IO uint8_t   flgShipping;
extern __IO uint16_t  WaveRec_idxTest;
extern __IO uint8_t  swtBufUSBOut;
extern __IO uint8_t flgRacing;


/* Buffer used for reception */
uint8_t aRxBuffer[1024];
uint8_t idxDec,stFrstFrmStore;
int16_t DeltaBuf1,DeltaBuf1Old;
int16_t idxLatency13,idxLatency12,idxLatency14,idxLatency25,idxLatency63,idxLatency78;
int16_t * LowPass_Mic1Old;
int16_t *LowPass_Mic2Old;
int16_t *LowPass_Mic3Old; 
int16_t *LowPass_Mic4Old;
int16_t *LowPass_Mic5Old;
int16_t *LowPass_Mic6Old;
int16_t *LowPass_Mic7Old;
int16_t *LowPass_Mic8Old;

__IO char flg10ms;
uint8_t flgSTAIni;
uint16_t cntTime200;

uint8_t buffer_switch = 1;
uint8_t Command_index=1;

float fir256Coff[DSP_NUMCOFFHANNIING];
//int16_t PreCalcBuff[129][256];


#if MAIN_CRSCORR
arm_rfft_instance_q15 RealFFT_Ins, RealIFFT_Ins;
#endif

//arm_cfft_radix4_instance_f32 SS,SS1,SS2,SS3,SS4,ISS; 
//arm_rfft_instance_f32 S,S1,S2,S3,S4,IS;

arm_rfft_fast_instance_f32 S,S1,S2,S3,S4,IS;


#if (DEBUG)
uint8_t  pUARTBuf[128];
uint32_t Main_CoefMor;
uint8_t stDir,flgS2,flgS3,flgS4,flgS2Flt,flgS3Flt,flgS4Flt;
uint8_t flgS2Ins,flgS3Ins,flgS4Ins;
#endif

#if USB_STREAMING
extern __IO uint16_t idxFrmPDMMic8;
#endif


/* Private function prototypes -----------------------------------------------*/
static void SystemClock_Config(void);
static void USBH_UserProcess(USBH_HandleTypeDef *phost, uint8_t id);
static void CPU_CACHE_Enable(void);




void HAL_I2C_MspInit(I2C_HandleTypeDef* hi2c);
void MX_I2C2_Init(void);
void USART3_Init(void);
void ReadSTASeq(uint8_t Addr, uint8_t *pBufOut,uint8_t Len );
void WriteSTAByte(uint8_t Addr, uint8_t *pBufIn, uint8_t len);
void SPI5_CallBack(SPI_HandleTypeDef *hspi);
uint8_t StartPlay(void);


/*--------------INLINE FUNCTION-----------------------------------------------*/

inline static void FFT_Update(void)
{

            
      /* Hafl buffer is filled in by I2S data stream in */
      if((flgDlyUpd==0))
      {
            PDM2PCMSDO78();
            //HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_15); 
            FactorUpd(&FacMic); 
            //STM_EVAL_LEDOn(LED3);
            flgDlyUpd = 1; 
/*-------------------------------------------------------------------------------------------------------------
			  
	Sequence  Record Data                     Processing Data                 Player Data
			  
	1-------  Buffer1                         Buffer2                         Buffer3
			  
	2-------  Buffer3                         Buffer1                         Buffer2		  
			  
	3-------  Buffer2                         Buffer3                         Buffer1 
 ---------------------------------------------------------------------------------------------------------------*/
            /* Processing Data */
			switch (buffer_switch)  //buffer_switch
			{             
			    case BUF1_PLAY:
#if MAIN_CRSCORR
                            for (uint16_t i=0; i<(_MAX_SS/_MAX_SS);i++)
                            {
                                //uint16_t i=0;
                                    arm_rfft_q15(&RealFFT_Ins,    (q15_t *)&buffer3[i*128],    (q15_t *)&bufferFFT[i*256]);
                                    arm_rfft_q15(&RealFFT_Ins,    (q15_t *)&buffer3_1[i*128],   (q15_t *)&bufferFFT_1[i*256]);
                            
                                    arm_add_q15((q15_t *)&bufferFFT[i*256],    (q15_t *)&bufferFFT_1[i*256],    (q15_t *)&bufferFFTSum[i*256],2*128);
                            
                                    //for (uint16_t j=0; j<256;j++)
                                    //{
                                    //	  bufferFFTSum[i*256+j]<<=6;
                                    //}
                                    
