PhanLeSon03/Mic_Array/Projects/STM32746G/Applications/Audio/Mic_Array/Src/main.c
		       }
	
		/* USB Host Background task */
		//USBH_Process(&hUSBHost);

		/* AUDIO Menu Process */
		//AUDIO_MenuProcess();
		
		FFT_Update();   

		if (flg10ms==1)
		{
		    flg10ms=0;		   		      
	         cntTime200++;
	         if (cntTime200==40)
	         {
	 
#if (DEBUG)
                   uint32_t tmpSNR63,tmpSNR14,tmpSNR78,tmpSNR25;
                   tmpSNR78 = (uint32_t)(CrssCorVal78/EnergyError);
                   tmpSNR25 = (uint32_t)(CrssCorVal25/EnergyError);
				   tmpSNR14 = (uint32_t)(CrssCorVal14/EnergyError);
				   tmpSNR63 = (uint32_t)(CrssCorVal63/EnergyError);
                    //if (tmpSNR>10)
                    {
                        int16_t test[5];
                        static uint8_t flagNotMin;
                        test[0] = 0;
						if (CrssCorVal63>10)						
                            test[1]= idxLatency63;
						else
							test[1] = 0;

						if (CrssCorVal14>10)
                            test[2]= idxLatency14;
						else
							test[2] =0;

						if (CrssCorVal25 > 10)
                            test[3]= idxLatency25;
						else
							test[3] = 0;

                        if (CrssCorVal78>10)
						    test[4]= idxLatency78;                        
						else
							test[4]= 2;

						if (((CrssCorVal63>10))||((CrssCorVal14>10))||((CrssCorVal25>10))||((CrssCorVal78>10)))
                        {
                             sprintf((char *)pUARTBuf,"%d:%d:%d:%d  ",idxLatency63,idxLatency14,idxLatency25,idxLatency78);
                             flagNotMin=0 ;
                              sprintf((char *)(pUARTBuf+15),"----------\r\n");
                              if (test[3]>0)
                              {
                                      sprintf((char *)(pUARTBuf+15),"Close Mic 5\r\n"); 
									  flagNotMin=1;
                              }
                              else if (test[3]<0)
                              {
                                    sprintf((char *)(pUARTBuf+15),"Clsoe Mic 2\r\n");
									flagNotMin=1;

                              }
                              else
                              {
                                   
                              }	

						
				                if (test[2]>0)
		                  	    {
		                  	       if((CrssCorVal14>CrssCorVal25)||(flagNotMin==0))
		                  	       {
		                             sprintf((char *)(pUARTBuf+15),"Clsoe Mic 4\r\n");
									 flagNotMin=2;
		                  	       }
		                  	    }
		                        else if (test[2]<0)
		                        {
		                            if((CrssCorVal14>CrssCorVal25)||(flagNotMin==0))
		                            {
		                              sprintf((char *)(pUARTBuf+15),"Clsoe Mic 1\r\n");                             
									  flagNotMin=2;
		                            }
		                        }
		                        else
		                        {

		                        }

						   
		                        if (test[1]>0)
		                  	    {
		                  	       if((((CrssCorVal63>CrssCorVal25)&&(flagNotMin==1))||(flagNotMin==0))||((CrssCorVal63>CrssCorVal14)&&(flagNotMin==2)))
		                  	       {
								     sprintf((char *)(pUARTBuf+15),"Clsoe Mic 3\r\n");
								     flagNotMin=3;
		                  	       }
		                  	    }
		                        else if (test[1]<0)
		                        {
		                             if((((CrssCorVal63>CrssCorVal25)&&(flagNotMin==1))||(flagNotMin==0))||((CrssCorVal63>CrssCorVal14)&&(flagNotMin==2)))
		                             {
		                               sprintf((char *)(pUARTBuf+15),"Clsoe Mic 6\r\n"); 
									   flagNotMin=3;
		                             }
		                        }
		                        else
		                        {

		                        }


	                            if ((test[4]>3))
	                            {
	                                if ((flagNotMin==0))                                     
	                                    sprintf((char *)(pUARTBuf+15),"Clsoe Mic 7\r\n");
								    else if ((flagNotMin==1))
										if ((CrssCorVal78>CrssCorVal25))
											sprintf((char *)(pUARTBuf+15),"Clsoe Mic 7\r\n");
								    else if ((flagNotMin==2))
										if ((CrssCorVal78>CrssCorVal14))
											sprintf((char *)(pUARTBuf+15),"Clsoe Mic 7\r\n");	
								    else if ((flagNotMin==3))
										if ((CrssCorVal78>CrssCorVal63))
											sprintf((char *)(pUARTBuf+15),"Clsoe Mic 7\r\n");
									else
										;
									
	                            }
	                            else if (test<=0)
	                            {
	                                if ((flagNotMin==0))                                     
	                                    sprintf((char *)(pUARTBuf+15),"Clsoe Mic 8\r\n");
								    else if ((flagNotMin==1))
										if ((CrssCorVal78>CrssCorVal25))
											sprintf((char *)(pUARTBuf+15),"Clsoe Mic 8\r\n");
								    else if ((flagNotMin==2))
										if ((CrssCorVal78>CrssCorVal14))
											sprintf((char *)(pUARTBuf+15),"Clsoe Mic 8\r\n");	
								    else if ((flagNotMin==3))
										if ((CrssCorVal78>CrssCorVal63))
											sprintf((char *)(pUARTBuf+15),"Clsoe Mic 8\r\n");
									else
										;
									
	                            }                          
	                            else
	                            {
	                            }


			  //if (flagNotMin==0) sprintf((char *)(pUARTBuf+15),"----------- \r\n");
									
                          //HAL_UART_Transmit_IT(&huart3,pUARTBuf,15);
                          SrvB_Debound(&flgS2Ins,&flgS2Flt, flgS2,2);
                          SrvB_Debound(&flgS3Ins,&flgS3Flt, flgS3,2);
                          SrvB_Debound(&flgS4Ins,&flgS4Flt, flgS4,2);

                          stDir = (flgS2Flt<<2)|(flgS3Flt<<1)|(flgS4Flt); 
                         
                           sprintf((char *)(pUARTBuf+30),"%d:%d:%d:%d\n\r\n\r",CrssCorVal63,CrssCorVal14,CrssCorVal25,CrssCorVal78);
                           HAL_UART_Transmit_IT(&huart3,pUARTBuf,15+15+15);		
                         }
                    }//if(SNR)

#endif
	   	            cntTime200=0;
        } //(cntTime200==40)
      }//if (flg10ms==1)	
  }
}

/**
  * @brief  Toggle Leds.
  * @param  None
  * @retval None
  */
void Toggle_Leds(void)
{
  static uint32_t ticks = 0;

  if (ticks++ > 200)
  {
    //BSP_LED_Toggle(LED1);
    ticks = 0;
  }
}


/**
  * @brief  User Process
  * @param  phost: Host Handle
  * @param  id: Host Library user message ID
  * @retval None
  */
static void USBH_UserProcess(USBH_HandleTypeDef *phost, uint8_t id)
{
  switch(id)
  { 
  case HOST_USER_SELECT_CONFIGURATION:
    break;
    
  case HOST_USER_DISCONNECTION:
    appli_state = APPLICATION_DISCONNECT;
    break;

  case HOST_USER_CLASS_ACTIVE:
    appli_state = APPLICATION_READY;
    break;
 
  case HOST_USER_CONNECTION:
    appli_state = APPLICATION_START;
    break;
   
  default:
    break; 
  }
}

/**
  * @brief  System Clock Configuration
  *         The system Clock is configured as follow : 
  *            System Clock source            = PLL (HSE)
  *            SYSCLK(Hz)                     = 216000000
  *            HCLK(Hz)                       = 216000000
  *            AHB Prescaler                  = 1
  *            APB1 Prescaler                 = 4
  *            APB2 Prescaler                 = 2
  *            HSE Frequency(Hz)              = 25000000
  *            PLL_M                          = 25
  *            PLL_N                          = 432
  *            PLL_P                          = 2
  *            PLL_Q                          = 9
  *            VDD(V)                         = 3.3
  *            Main regulator output voltage  = Scale1 mode
  *            Flash Latency(WS)              = 7
  * @param  None
  * @retval None
  */
static void SystemClock_Config(void)
{
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_PeriphCLKInitTypeDef PeriphClkInitStruct;
  HAL_StatusTypeDef ret = HAL_OK;

  /* Enable HSE Oscillator and activate PLL with HSE as source */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 25;
  RCC_OscInitStruct.PLL.PLLN = 432;  // 432
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 9;

  ret = HAL_RCC_OscConfig(&RCC_OscInitStruct);
  if(ret != HAL_OK)
  {
    //while(1) { ; }
  }

  /* Activate the OverDrive to reach the 216 MHz Frequency */
  ret = HAL_PWREx_EnableOverDrive();
  if(ret != HAL_OK)
  {
    //while(1) { ; }
  }

  /* Select PLLSAI output as USB clock source */
  PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_CLK48 ;
  PeriphClkInitStruct.Clk48ClockSelection = RCC_CLK48SOURCE_PLLSAIP;

  
