PhanLeSon03/Mic_Array/Projects/STM32746G/Applications/Audio/Mic_Array/Src/main.c
}

/*---------------------------------------------------*/
/*   UART                                            */
/* UART4 init function */
void USART3_Init(void)
{

  huart3.Instance = USART3;
  huart3.Init.BaudRate = 115200;
  huart3.Init.WordLength = UART_WORDLENGTH_8B;
  huart3.Init.StopBits = UART_STOPBITS_1;
  huart3.Init.Parity = UART_PARITY_NONE;
  huart3.Init.Mode = UART_MODE_TX_RX;
  huart3.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart3.Init.OverSampling = UART_OVERSAMPLING_16;
  huart3.Init.OneBitSampling = UART_ONEBIT_SAMPLING_DISABLED ;
  huart3.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
  HAL_UART_Init(&huart3);

  //HAL_NVIC_SetPriority(USART3_IRQn, 1, 1);
  //HAL_NVIC_EnableIRQ(USART3_IRQn);

}


void HAL_UART_MspInit(UART_HandleTypeDef *huart)
{

  GPIO_InitTypeDef GPIO_InitStruct;
  if(huart->Instance==USART3)
  {


  /* USER CODE END UART4_MspInit 0 */
    /* Peripheral clock enable */
    __USART3_CLK_ENABLE();
    __GPIOC_CLK_ENABLE();
  
    /**UART4 GPIO Configuration    
    PC10     ------> USART3_TX
    PC11     ------> USART3_RX
    */
    GPIO_InitStruct.Pin = GPIO_PIN_10|GPIO_PIN_11;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF7_USART3;
    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

    /* NVIC for USART */
    HAL_NVIC_SetPriority(USART3_IRQn, 7, 1);
    HAL_NVIC_EnableIRQ(USART3_IRQn);

  }

}



void EXTI4_IRQHandler(void)
{
    /* EXTI line interrupt detected */
  if(__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_4) != RESET)
  {
    
     if (cntRisingEXTI==20)
     {
    	/*--------------Enable read PCM data --------------------*/   
        //flgDlyUpd = 1;  
        //__HAL_SPI_ENABLE_IT(&hspi5, (SPI_IT_RXNE| SPI_IT_ERR));
		//__HAL_UNLOCK(&hspi5);
        //__HAL_SPI_ENABLE(&hspi5);
        cntRisingEXTI=0;

        /*Disable external interrupt */
        HAL_NVIC_DisableIRQ((IRQn_Type)(EXTI4_IRQn));
        //HAL_GPIO_DeInit(GPIOB,GPIO_PIN_4);
     }
     else
     {
        cntRisingEXTI++;
        //__HAL_SPI_DISABLE(&hspi5);
     }
     
      __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_4);

  }
}
              
void EXTI15_10_IRQHandler(void)
{

}

/* Events for Button Press */
void EXTI9_5_IRQHandler(void)
{

  /* EXTI line interrupt detected */
  if(__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_8) != RESET)
  {
	  btnSW2 = 1;
	  if ((++cntBtnPress)==8) cntBtnPress=0;
	  BSP_LED_Toggle(LED2);
	  __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_8);

  }


  /* EXTI line interrupt detected */
  if(__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_9) != RESET)
  {
		btnSW1 = 1;
		Command_index^=0x01;
		BSP_LED_Toggle(LED1);

	   __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_9);
  }

}


void DFT_Init(void)
{
#if MAIN_CRSCORR
		arm_rfft_init_q15(&RealFFT_Ins,(uint32_t)128,(uint32_t)0,(uint32_t)1);
		arm_rfft_init_q15(&RealIFFT_Ins,(uint32_t)128,(uint32_t)1,(uint32_t)1);
#endif  
		/* Initialize the CFFT/CIFFT module */
		//arm_rfft_init_f32(&S,&SS, 512,  0, 1);
		//arm_rfft_init_f32(&S1,&SS1, 512,  0, 1); 
		//arm_rfft_init_f32(&S2,&SS2, 512,  0, 1); 
		//arm_rfft_init_f32(&S3,&SS3, 512,  0, 1); 
		//arm_rfft_init_f32(&S4,&SS4, 512,  0, 1);
		//arm_rfft_init_f32(&IS,&ISS, 512,  1, 1);
		

		//arm_rfft_fast_init_f32(&S1, 512);
        //arm_rfft_fast_init_f32(&S2, 512);
		//arm_rfft_fast_init_f32(&S3, 512);
		//arm_rfft_fast_init_f32(&S4, 512);
		//arm_rfft_fast_init_f32(&IS, 512);
		arm_rfft_fast_init_f32(&S, 1024);
}


void SumDelay(Mic_Array_Data *BufferIn)
{
    //if (idxLatency12>idxLatency13)
    // {
    //     if (idxLatency13 > idxLatency14)
    //     {
    //         /* MIC2 --> MIC3 --> MIC4 */
    //     }
    //             else if (idxLatency14 > idxLatency12)
    //             {
    //        /* MIC4-->MIC2-->MIC3  */
    //            }
    //             else
    //             {
    //       /* MIC2-->MIC4-->MIC3  */
    //             }
    // }
    //else // idxLatency13>idxLatency12
    //     {
    //    if (idxLatency12 > idxLatency14)
    //    {
    //        //MIC3 --> MIC2 --> MIC4 
    //    }
    //        else if (idxLatency14 > idxLatency13)
    //        {
    //        //MIC4 --> MIC3 --> MIC2
    //        }
    //        else
    //        {
    //        //MIC3 --> MIC4 --> MIC2
    //	   }
    //}
	
    for(uint16_t i=0;i<AUDIO_OUT_BUFFER_SIZE;i++)
    {
      bufferSum[6*i] = (uint16_t)(BufferIn->bufMIC1[i]*FacMic.facMIC1 + 
      BufferIn->bufMIC2[i]*FacMic.facMIC2 + 
      BufferIn->bufMIC3[i]*FacMic.facMIC3 + 
      BufferIn->bufMIC4[i]*FacMic.facMIC4); 		
      bufferSum[6*i+1] = bufferSum[6*i];
	  bufferSum[6*i+2] = bufferSum[6*i];
	  bufferSum[6*i+3] = bufferSum[6*i];
	  bufferSum[6*i+4] = bufferSum[6*i];
	  bufferSum[6*i+5] = bufferSum[6*i];
    }
  
    
}


void ButtonInit(void)
{
  /* PI8: SW2 */
  /* PI9: SW1 */
  /* ----------------------*/
  __GPIOB_CLK_ENABLE();
  GPIO_INS.Pin = GPIO_PIN_8|GPIO_PIN_9;
  GPIO_INS.Mode =GPIO_MODE_IT_RISING;
  GPIO_INS.Pull =GPIO_NOPULL;
  GPIO_INS.Speed =GPIO_SPEED_HIGH;
  HAL_GPIO_Init(GPIOI,&GPIO_INS);

  /* Enable and set Button EXTI Interrupt to the lowest priority */
  HAL_NVIC_SetPriority((IRQn_Type)EXTI9_5_IRQn, 0x0F, 0x00);
  HAL_NVIC_EnableIRQ((IRQn_Type)EXTI9_5_IRQn);
  /*-----------------------*/
}


/* I2C2 init function */
void MX_I2C2_Init(void)
{
  __HAL_I2C_DISABLE(&hi2c2);
  hi2c2.Instance = I2C2;
  hi2c2.Init.Timing =0x00A0689A ;//I2C_TIMING  0x00303D5D 0x00A0689A
  hi2c2.Init.OwnAddress1 = 0;
  hi2c2.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
  hi2c2.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
  hi2c2.Init.OwnAddress2 = 0;
  hi2c2.Init.OwnAddress2Masks = I2C_OA2_NOMASK;
  hi2c2.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
  hi2c2.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
  HAL_I2C_Init(&hi2c2);

  /**Configure Analogue filter 
  */
  //HAL_I2CEx_AnalogFilter_Config(&hi2c2, I2C_ANALOGFILTER_ENABLE);

}

 void HAL_I2S_TxCpltCallback(I2S_HandleTypeDef *hi2s)
{  
  //Audio_Play_Out();  
  #if (AUDIO_OUT_STREAM_NORMAL)
      Audio_MAL_Play((uint32_t)&bufferSum[(6*AUDIO_SAMPLING_FREQUENCY/1000)], 6*AUDIO_CHANNELS*(AUDIO_SAMPLING_FREQUENCY/1000));
  #else

  #endif  

  
