PhanLeSon03/Mic_Array/Projects/STM32746G/Applications/Audio/Mic_Array/Src/main.c
}

 uint8_t StartPlay(void)
 {
 #if 0
	while (1)
	{
		 /* there is data in the buffer */	
		 if((WaveRec_idxSens1>=(AUDIO_OUT_BUFFER_SIZE-1))&&(stFrstFrmStore<3))
		 {
			 RESET_IDX
			 /* this is just run 1 time after 1st frame of I2S data full */
			 if ((stFrstFrmStore<3))
			 {
                             stFrstFrmStore++;
             
                             buffer_switch = BUF2_PLAY; /* record data to buffer3 */
             
                             if (stFrstFrmStore==2)
                             {
                                 
         
                                 /*------------------------PLAYER------------------------------------------*/
                                 Audio_MAL_Play((uint32_t)bufferSum,2*6*AUDIO_CHANNELS*(AUDIO_SAMPLING_FREQUENCY/1000));
                                 /*------------------------------------------------------------------------*/				 
                                 buffer_switch = BUF1_PLAY;
								 uint16_t tdelay=100;
								 while(tdelay--);
                                 //StartRecMic7_8();
                                 return 0;		 
                             }				 
                     
			 }
		 
		 }
	}
#endif	

     /*------------------------PLAYER------------------------------------------*/
	 Audio_MAL_Play((uint32_t)bufferSum,6*AUDIO_CHANNELS*(AUDIO_SAMPLING_FREQUENCY/1000));
	 /*------------------------------------------------------------------------*/     	   	 
	 HAL_Delay(100);
     	
     //HAL_Delay(1);
     //for (uint32_t i=0; i<2000;i++)
     //{
	 //  __NOP;
	 //  __NOP;
	 //  __NOP;
	 //  __NOP;
     //}
     I2S1_Enable();
     I2S2_Enable();
     SPI4_Enable();
     StartRecMic7_8();
	 WaveRec_idxSens1 = 0;
	 WaveRec_idxSens2 = 0;
	 WaveRec_idxSens3 = 0;
	 WaveRec_idxSens4 = 0;
	 WaveRec_idxSens5 = 0;
	 WaveRec_idxSens6 = 0; 
	 idxFrmPDMMic8 = 0;
	 buffer_switch = BUF1_PLAY;
	
	 
 }

void SubFrameFinished(void)
{
    Audio_Play_Out();
}
/*****************************END OF FILE**************************************/
